CNLHC/NUEDC-Toolbox/drive/stm32/ad7606/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KEY0_Pin GPIO_PIN_4
#define KEY0_GPIO_Port GPIOE
#define OS0_Pin GPIO_PIN_0
#define OS0_GPIO_Port GPIOC
#define OS1_Pin GPIO_PIN_1
#define OS1_GPIO_Port GPIOC
#define OS2_Pin GPIO_PIN_2
#define OS2_GPIO_Port GPIOC
#define STA_Pin GPIO_PIN_4
#define STA_GPIO_Port GPIOA
#define STB_Pin GPIO_PIN_6
#define STB_GPIO_Port GPIOA
#define SCLK_Pin GPIO_PIN_10
#define SCLK_GPIO_Port GPIOC
#define RESET_Pin GPIO_PIN_11
#define RESET_GPIO_Port GPIOC
#define CS_Pin GPIO_PIN_12
#define CS_GPIO_Port GPIOC
#define BUSY_Pin GPIO_PIN_4
#define BUSY_GPIO_Port GPIOB
#define OUTA_Pin GPIO_PIN_6
#define OUTA_GPIO_Port GPIOB
#define OUTB_Pin GPIO_PIN_7
#define OUTB_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
